const { cmd } = require('../lib')

//--------------------------------------------------------------------------------

const asma2 = [
    {
        "id": 1,
        "name":"اللَّهُ",
        "text":"وهو الاسم الأعظم الذي تفرد به الحق سبحانه وخص به نفسه وجعله أول أسمائه، وأضافها كلها إليه فهو علم على ذاته سبحانه"
    },
    {
        "id": 2,
        "name":"الرَّحْمَنُ",
        "text":"كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين"
    },
    {
        "id": 3,
        "name":"الرَّحِيم",
        "text":"هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي"
    },
    {
        "id": 4,
        "name":"المَلِك",
        "text":"هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق"
    },
    {
        "id": 5,
        "name":"الْقُدُّوس",
        "text":"هو الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول"
    },
    {
        "id": 6,
        "name":"السَّلَام",
        "text":"هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء"
    },
    {
        "id": 7,
        "name":"المُؤْمِن",
        "text":"هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم"
    },
    {
        "id": 8,
        "name":"الْمُهَيْمِن",
        "text":"هو الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، والمطلع على خفايا الأمور وخبايا الصدور"
    },
    {
        "id": 9,
        "name":"الْعَزِيز",
        "text":"هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء"
    },
    {
        "id": 10,
        "name":"الْجَبَّار",
        "text":"هو الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد"
    },
    {
        "id": 11,
        "name":"الْمُتَكَبِّر",
        "text":"هو المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء"
    },
    {
        "id": 12,
        "name":"الْخَالِق",
        "text":"هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته"
    },
    {
        "id": 13,
        "name":"الْبَارِئ",
        "text":"هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود"
    },
    {
        "id": 14,
        "name":"الْمُصَوِّر",
        "text":"هو الذي صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها وكثرتها"
    },
    {
        "id": 15,
        "name":"اَلْغَفَّار",
        "text":"هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة"
    },
    {
        "id": 16,
        "name":"الْقَهَّار",
        "text":"هو الغالب الذي قهر خلقه بسلطانه وقدرته، وخضعت له الرقاب وذلت له الجبابرة، وصرف خلقه على ما أراد طوعا وكرها، وعنت الوجوه له"
    },
    {
        "id": 17,
        "name":"الْوَهَّاب",
        "text":"هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء"
    },
    {
        "id": 18,
        "name":"الرَّزَّاق",
        "text":"هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه"
    },
    {
        "id": 19,
        "name":"الْفَتَّاح",

        "text":"هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض"
    },
    {
        "id": 20,
        "name":"الْعَلِيم",

        "text":"هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء"
    },
    {
        "id": 21,
        "name":"الْقَابِضُ",
        "text":"هو الذي يقبض الرزق عمن يشاء من الخلق بعدله وحكمته، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"
    },
    {
        "id": 22,
        "name":"الْبَاسِطُ",
        "text":"هو الذي يقبض الرزق عمن يشاء من الخلق بعدله وحكمته، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"
    },
    {
        "id": 23,
        "name":"الخافض",
        "text":"هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات ويرفعهم على عدوهم فينصرهم وهو رافع السماوات السبع"
    },
    {
        "id": 24,
        "name":"الرَّافِعُ",
        "text":"هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات ويرفعهم على عدوهم فينصرهم وهو رافع السماوات السبع"
    },
    {
        "id": 25,
        "name":"المعز",
        "text":"هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"
    },
    {
        "id": 26,
        "name":"المذل",
        "text":"هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"
    },
    {
        "id": 27,
        "name":"السَّمِيعُ",
        "text":"ومعناه سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، ومعناه أيضًا: سمع الإجابة منه للسائلين والداعين والعابدين فيجيبهم ويثيبهم"
    },
    {
        "id": 28,
        "name":"الْبَصِير",
        "text":"هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيء علماً"
    },
    {
        "id": 29,
        "name":"الْحَكَم",
        "text":"هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه"
    },
    {
        "id": 30,
        "name":"العدل",
        "text":"هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه"
    },
    {
        "id": 31,
        "name":"اللَّطِيفُ",
        "text":"هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم"
    },
    {
        "id": 32,
        "name":"الْخَبِيرُ",
        "text":"هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون"
    },
    {
        "id": 33,
        "name":"الْحَلِيمُ",
        "text":"هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع"
    },
    {
        "id": 34,
        "name":"الْعَظِيمُ",
        "text":"هو العظيم في كل شئ، عظيم في ذاته وأسمائه وصفاته، عظيم في رحمته، عظيم في قدرته، عظيم في حكمته، عظيم في جبروته وكبريائه، عظيم في هبته وعطائه، عظيم في خبرته ولطفه، عظيم في بره وإحسانه، عظيم في عزته وعدله وحمده، فهو العظيم المطلق، فلا أحد يساويه"
    },
    {
        "id": 35,
        "name":"الْغَفُورُ",
        "text":"هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم. الفرق بين هذا الاسم واسم الغفار أن اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم وأيس صاحبه من المغفرة أما الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار"
    },
    {
        "id": 36,
        "name":"الشَّكُورُ",
        "text":"هو الذي يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها"
    },
    {
        "id": 37,
        "name":"الْعَلِيُّ",
        "text":"هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا"
    },
    {
        "id": 38,
        "name":"الْكَبِيرُ",
        "text":"هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)"
    },
    {
        "id": 39,
        "name":"الْحَفِيظُ",
        "text":"هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل"
    },
    {
        "id": 40,
        "name":"المُقِيت",
        "text":"هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد"
    },
    {
        "id": 41,
        "name":"الْحَسِيبُ",
        "text":"هو الكافي الذي منه كفاية العباد وهو الذي عليه الاعتماد يكفي العباد بفضله"
    },
    {
        "id": 42,
        "name":"الجليل",
        "text":"هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص"
    },
    {
        "id": 43,
        "name":"الْكَرِيمُ",
        "text":"هو الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله"
    },
    {
        "id": 44,
        "name":"الرَّقِيبُ",
        "text":"هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء"
    },
    {
        "id": 45,
        "name":"الْمُجِيبُ",
        "text":"هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه"
    },
    {
        "id": 46,
        "name":"الْوَاسِعُ",
        "text":"هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء"
    },
    {
        "id": 47,
        "name":"اَلْحَكِيمُ",
        "text":"هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل"
    },
    {
        "id": 48,
        "name":"الْوَدُودُ",
        "text":"هو المحب لعباده، والمحبوب في قلوب أوليائه"
    },
    {
        "id": 49,
        "name":"الْمَجِيدُ",
        "text":"هو الله تمجَّد بفعاله، ومجَّده خلقه لعظمته، والمجيد هو واسع الكرم، ووصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه. وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر. تمجد"
    },
    {
        "id": 50,
        "name":"الباعث",
        "text":"هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد"
    },
    {
        "id": 51,
        "name":"الشَّهِيدُ",
        "text":"هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله"
    },
    {
        "id": 52,
        "name":"الْحَقُّ",
        "text":"هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة"
    },
    {
        "id": 53,
        "name":"الْوَكِيلُ",
        "text":"هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه"
    },
    {
        "id": 54,
        "name":"الْقَوِيّ",
        "text":"هو صاحب القدرة التامة البالغة الكمال غالب لا يُغلب فقوته فوق كل قوة، ولايرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه"
    },
    {
        "id": 55,
        "name":"الْمَتِينُ",
        "text":"هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين، فهو المتناهي في القوة، التي لاتلحق أفعاله مشقة، ولايمسه فيها لغوب"
    },
    {
        "id": 56,
        "name":"الْوَلِيُّ",
        "text":"هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم"
    },
    {
        "id": 57,
        "name":"الْحَمِيدُ",
        "text":"هو المستحق للحمد والثناء له منتهى الحمد وأطيبه على ذاته وصفاته وعلى نعمه التي لا تحصى"
    },
    {
        "id": 58,
        "name":"الْـمُحصِي",
        "text":"هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل"
    },
    {
        "id": 59,
        "name":"المبدئ",
        "text":"هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال"
    },
    {
        "id": 60,
        "name":"المعيد",
        "text":"هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة"
    },
    {
        "id": 61,
        "name":"المُحيي",
        "text":"هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت"
    },
    {
        "id": 62,
        "name":"المميت",
        "text":"هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء"
    },
    {
        "id": 63,
        "name":"الْحَيُّ",
        "text":"هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت"
    },
    {
        "id": 64,
        "name":"الْقَيُّومُ",
        "text":"هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم"
    },
    {
        "id": 65,
        "name":"الواجد",
        "text":"هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده"
    },
    {
        "id": 66,
        "name":"الماجد",
        "text":"هو الذي له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة"
    },
    {
        "id": 67,
        "name":"الْوَاحِدُ",
        "text":"هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه"
    },
    {
        "id": 68,
        "name":"الصَّمَدُ",
        "text":"هو المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم"
    },
    {
        "id": 69,
        "name":"الْقَادِرُ",
        "text":"هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه"
    },
    {
        "id": 70,
        "name":"الْمُقْتَدِرُ",
        "text":"هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره"
    },
    {
        "id": 71,
        "name":"الْمُقَدِّمُ",
        "text":"هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه"
    },
    {
        "id": 72,
        "name":"الْمُؤَخِّرُ",
        "text":"هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير"
    },
    {
        "id": 73,
        "name":"الْأَوَّلُ",
        "text":"هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود"
    },
    {
        "id": 74,
        "name":"الْآخِرُ",
        "text":"هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء"
    },
    {
        "id": 75,
        "name":"الظَّاهِرُ",
        "text":"هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله"
    },
    {
        "id": 76,
        "name":"الْبَاطِنُ",
        "text":"هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد"
    },
    {
        "id": 77,
        "name":"الوالي",
        "text":"هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه"
    },
    {
        "id": 78,
        "name":"الْمُتَعَالِ",
        "text":"هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين"
    },
    {
        "id": 79,
        "name":"الْبَرُّ",
        "text":"هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد"
    },
    {
        "id": 80,
        "name":"التَّوَّابُ",
        "text":"هو الذي يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب"
    },
    {
        "id": 91,
        "name":"الْمُنْتَقِمُ",
        "text":"هو الذي يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار"
    },
    {
        "id": 82,
        "name":"العَفُو",
        "text":"هو الذي يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي"
    },
    {
        "id": 83,
        "name":"الرَّؤُوفُ",
        "text":"هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومَنَّ بتعطفه، يستر العيوب ثم يعفو عنها"
    },
    {
        "id": 84,
        "name":"مَالِكُ الْمُلْكِ",
        "text":"هو المتصرف في ملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره"
    },
    {
        "id": 85,
        "name":"ذُو الْجَلَالِ والْإكْرَامِ",
        "text":"هو المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل"
    },
    {
        "id": 86,
        "name":"المقسط",
        "text":"هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم"
    },
    {
        "id": 87,
        "name":"الْجَامِعُ",
        "text":"هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين"
    },
    {
        "id": 88,
        "name":"الْغَنِيُّ",
        "text":"هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه"
    },
    {
        "id": 89,
        "name":"المغني",
        "text":"هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده"
    },
    {
        "id": 90,
        "name":"الْمُعْطِي",
        "text":"هو الذي أعطى كل شيء"
    },
    {
        "id": 91,
        "name":"المانع",
        "text":"يمنع العطاء عن من يشاء ابتلاء أو حماية"
    },
    {
        "id": 92,
        "name":"الضار",
        "text":"هو المقدر للضر على من أراد كيف أراد"
    },
    {
        "id": 93,
        "name":"النافع",
        "text":"مقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"
    },
    {
        "id": 94,
        "name":"النُّورُ",
        "text":"هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره"
    },
    {
        "id": 95,
        "name":"الْهَادِي",
        "text":"هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته"
    },
    {
        "id": 96,
        "name":"الْبَدِيعُ",
        "text":"هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال"
    },
    {
        "id": 97,
        "name":"الباقي",
        "text":"هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء"
    },
    {
        "id": 98,
        "name":"الْوَارِثُ",
        "text":"هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها"
    },
    {
        "id": 99,
        "name":"الرشيد",
        "text":"هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد"
    },
    {
        "id": 100,
        "name":"الصبور",
        "text":"هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه"
    }
];

cmd({
  pattern: "allah",
  alias: ["اسماء_الله"],
}, async (Void, citel) => {
  const randomIndex = Math.floor(Math.random() * asma2.length);
  const randomEntry = asma2[randomIndex];
  await Void.sendMessage(citel.chat, {
    text: `
    ⊹⊱≼━━━⌬〔🕋〕⌬━━━≽⊰⊹         
֎ ╎asma allah alhusna :

*Name :* ${randomEntry.name}

*explan :* ${randomEntry.text}
             
⊹⊱≼━━━⌬〔🕋〕⌬━━━≽⊰⊹
 `
  });
});

//----------------------------------------------------------------

const quizData = [
  {
    "question": "كم كان عمر النبي محمد صلى الله عليه وسلم عندما توفيت أمه؟",
    "answer_1": "3 سنوات",
    "answer_2": "4 سنوات",
    "answer_3": "5 سنوات",
    "answer_4": "6 سنوات",
    "right_answer": 3
  },
  {
    "question": "ما هي أطول سورة في القرآن الكريم؟",
    "answer_1": "سورة البقرة",
    "answer_2": "سورة آل عمران",
    "answer_3": "سورة النساء",
    "answer_4": "سورة المائدة",
    "right_answer": 1
  },
  {
    "question": "ما السورة التي ختمت باسم وقت من أوقات الصلاة؟",
    "answer_1": "سورة القدر",
    "answer_2": "سورة البلد",
    "answer_3": "سورة الأعلى",
    "answer_4": "سورة الفجر",
    "right_answer": 1
  },
  {
    "question": "كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟",
    "answer_1": "ستة",
    "answer_2": "سبعة",
    "answer_3": "تسعة",
    "answer_4": "خمسة",
    "right_answer": 2
  },
  {
    "question": "في أي جهة يقع باب الكعبة المشرفة؟",
    "answer_1": "في الجهة الغربية من الكعبة",
    "answer_2": "في الجهة الجنوبية من الكعبة",
    "answer_3": "في الجهة الشمالية من الكعبة",
    "answer_4": "في الجهة الشرقية من الكعبة",
    "right_answer": 4
  },
  {
    "question": "كم عدد مصارف الزكاة؟",
    "answer_1": "ثمانية",
    "answer_2": "خمسة",
    "answer_3": "سبعة",
    "answer_4": " تسعة",
    "right_answer": 1
  },
  {
    "question": "كم مرة ذكرت السيدة مريم في القرآن الكريم؟",
    "answer_1": "43 مرة",
    "answer_2": "55 مرة",
    "answer_3": "42 مرة",
    "answer_4": "34 مرة",
    "right_answer": 4
  },
  {
    "question": "قال تعالى في سورة العاديات: ( فالمغيرات صبحا (3)) ماالمقصود بالمغيرات؟",
    "answer_1": "الرياح الشديدة",
    "answer_2": "الابل",
    "answer_3": "الملائكة السابحين",
    "answer_4": "الخيل",
    "right_answer": 4
  },
  {
    "question": "ما هي أعظم آية في القرآن الكريم؟",
    "answer_1": "آية الكرسي",
    "answer_2": "آخر آية من سورة الكهف",
    "answer_3": "آخر آية من سورة البقرة",
    "answer_4": "أول آية من سورة البقرة",
    "right_answer": 1
  },
  {
    "question": "أحد هؤلاء الصحابة من العشرة المبشرين بالجنة؟",
    "answer_1": "سلمان الفارسي",
    "answer_2": "عقيل بن أبي طالب",
    "answer_3": "سعد بن أبي وقاص",
    "answer_4": "الأشعث بن قيس",
    "right_answer": 3
  },
  {
    "question": "في أي سنة هجرية كانت غزوة أحد؟",
    "answer_1": "السنة الثالثة للهجرة",
    "answer_2": "السنة الرابعة للهجرة",
    "answer_3": "السنة الخامسة للهجرة",
    "answer_4": "السنة السادسة للهجرة",
    "right_answer": 1
  },
  {
    "question": "من هي النصرانية التي أسلمت ثم تزوجها النبي صلى الله عليه وسلم؟",
    "answer_1": "جويرية بنت الحارث",
    "answer_2": "ميمونة",
    "answer_3": "سودة بنت زمعة",
    "answer_4": "مارية القبطية",
    "right_answer": 4
  },
  {
    "question": "من هو النبي الذي أرسل الى قوم ثمود؟",
    "answer_1": "صالح",
    "answer_2": "هود",
    "answer_3": "نوح",
    "answer_4": "شعيب",
    "right_answer": 1
  },
  {
    "question": "ما عدد أحزاب القرآن الكريم؟",
    "answer_1": "50 حزبا",
    "answer_2": "40 حزبا",
    "answer_3": "30 حزبا",
    "answer_4": "60 حزبا",
    "right_answer": 4
  },
  {
    "question": "قال تعالى في سورة المدثر: (والرجز فاهجر (5)) ما المقصود بالرجز؟",
    "answer_1": "الكذب",
    "answer_2": "الأوثان",
    "answer_3": "الجدال",
    "answer_4": "النوم",
    "right_answer": 2
  },
  {
    "question": "قال تعالى: (والصافات صفا * فالزاجرات زجرا) ما المقصود بالزاجرات؟",
    "answer_1": "الملائكة",
    "answer_2": "الرياح",
    "answer_3": "الغمام",
    "answer_4": "السحاب",
    "right_answer": 1
  },
  {
    "question": "من هو الصحابي الذي كانت تستحي منه ملائكة السماء؟",
    "answer_1": "علي بن أبي طالب",
    "answer_2": "عثمان بن عفان",
    "answer_3": "عمر بن الخطاب",
    "answer_4": "أبو بكر الصديق",
    "right_answer": 2
  },
  {
    "question": "ما اسم السورة التي تنتهي آياتها بحرف السين؟",
    "answer_1": "لفلق",
    "answer_2": "الصمد",
    "answer_3": "الناس",
    "answer_4": "الضخى",
    "right_answer": 3
  },
  {
    "question": "كم عدد السور التي ابتدأت بالحروف المقطعة (الم)؟",
    "answer_1": "أربعة سور",
    "answer_2": "خمس سور",
    "answer_3": "ثلاث سور",
    "answer_4": "ستة سور",
    "right_answer": 4
  },
  {
    "question": "ما هو عدد حملة العرش يوم القيامة والمذكورين في القرآن الكريم؟",
    "answer_1": "سبعة",
    "answer_2": "ستة",
    "answer_3": "ثمانية",
    "answer_4": "تسعة",
    "right_answer": 3
  },
  {
    "question": "أين ذكرت الآية الكريمة: ( وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا)؟",
    "answer_1": "سورة الحشر",
    "answer_2": "سورة الصف",
    "answer_3": "سورة الجمعة",
    "answer_4": "سورة الواقعة",
    "right_answer": 1
  },
  {
    "question": "ما هي السورة التي يطلق عليها أم الكتاب؟",
    "answer_1": "سورة محمد",
    "answer_2": "سورة البقرة",
    "answer_3": "سورة يس",
    "answer_4": "سورة الفاتحة",
    "right_answer": 4
  },
  {
    "question": "كم شخص اشترك في قتل ناقة النبي صالح عليه السلام؟",
    "answer_1": "تسعة أشخاص",
    "answer_2": "خمسة أشخاص",
    "answer_3": "عشرة أشخاص",
    "answer_4": "ثمانية أشخاص",
    "right_answer": 1
  },
  {
    "question": "من الذي لقب الرسول الكريم بالطيب المطيب؟",
    "answer_1": "زيد بن حارثة",
    "answer_2": "أسامة بن زيد",
    "answer_3": "أنس بن مالك",
    "answer_4": "عمار بن ياسر",
    "right_answer": 4
  },
  {
    "question": "في أي سورة وردت الآية: (يمحق الله الربا ويربي الصدقات والله لا يحب كل كفار أثيم)؟",
    "answer_1": "المائدة",
    "answer_2": "البقرة",
    "answer_3": "آل عمران",
    "answer_4": "هود",
    "right_answer": 2
  },
  {
    "question": "في أي سورة وردت الآية التالية (ولبثوا في كهفهم ثلاث مئة سنين وازدادوا تسعا)؟",
    "answer_1": "سورة الكهف",
    "answer_2": "سورة فصلت",
    "answer_3": "سورة مريم",
    "answer_4": "سورة غافر",
    "right_answer": 1
  },
  {
    "question": "من هو النبي الذي دعا ربه (توفني مسلما وألحقني بالصالحين)؟",
    "answer_1": "يعقوب عليه السلام",
    "answer_2": "يوسف عليه السلام",
    "answer_3": "صالح عليه السلام",
    "answer_4": "ابراهيم عليه السلام",
    "right_answer": 2
  },
  {
    "question": "ما هي الرادفة؟",
    "answer_1": "يوم القيامة",
    "answer_2": "النفخة الأولى في البوق",
    "answer_3": "النفخة الثانية في البوق",
    "answer_4": "انشقاق الأرض",
    "right_answer": 3
  },
  {
    "question": "السورة التي ابتدأت بالحرفين المقطعين (طس)؟",
    "answer_1": "سورة الحجر",
    "answer_2": "سورة الرعد",
    "answer_3": "سورة الأعراف",
    "answer_4": "سورة النمل",
    "right_answer": 4
  },
  {
    "question": "ما هي السورة التي تسمى سورة التوديع؟",
    "answer_1": "سورة الزلزلة",
    "answer_2": "سورة الحج",
    "answer_3": "سورة النصر",
    "answer_4": "سورة الفيل",
    "right_answer": 3
  },
  {
    "question": "الشهر الثامن في التقويم الهجري؟",
    "answer_1": "شعبان",
    "answer_2": "ذو الحجة",
    "answer_3": "محرم",
    "answer_4": "شوال",
    "right_answer": 1
  },
  {
    "question": "كم عدد السور التي افتتحت بثلاثة أحرف؟",
    "answer_1": "16 سورة",
    "answer_2": "15 سورة",
    "answer_3": "14 سورة",
    "answer_4": "13 سورة",
    "right_answer": 4
  },
  {
    "question": "كم عدد آيات سورة البقرة؟",
    "answer_1": "286 آية",
    "answer_2": "280 آية",
    "answer_3": "277 آية",
    "answer_4": "298 آية",
    "right_answer": 1
  },
  {
    "question": "من أسماء الخيل التي ذكرت في القرآن الكريم؟",
    "answer_1": "الزاجرات",
    "answer_2": "النازعات",
    "answer_3": "الذاريات",
    "answer_4": "العاديات",
    "right_answer": 4
  },
  {
    "question": "كم عدد القراءات الصحيحة للقرآن الكريم؟",
    "answer_1": "7 قراءات",
    "answer_2": "8 قراءات",
    "answer_3": "9 قراءات",
    "answer_4": "10 قراءات",
    "right_answer": 4
  },
  {
    "question": "كم مرة اعتمر النبي صلى الله عليه وسلم؟",
    "answer_1": "أربع عمرات",
    "answer_2": "عمرة واحدة",
    "answer_3": "خمس عمرات",
    "answer_4": "سبع عمرات",
    "right_answer": 1
  },
  {
    "question": "ما اسم أخو يوسف عليه السلام من أمه وأبيه؟",
    "answer_1": "روأبين",
    "answer_2": "بنيامين",
    "answer_3": "يهوذا",
    "answer_4": "يوشع",
    "right_answer": 2
  },
  {
    "question": "قام أحدهم بمبادلة صاع من القمح الجيد بصاعين من القمح الرديء لشخص آخر ما حكم هذه المبادلة؟",
    "answer_1": "جائزة",
    "answer_2": "مضاربة",
    "answer_3": "ربا الفضل",
    "answer_4": "ربا النسيئة",
    "right_answer": 3
  },
  {
    "question": "في أي عام هجري وقعت غزوة خيبر؟",
    "answer_1": "10 هجري",
    "answer_2": "5 هجري",
    "answer_3": "9 هجري",
    "answer_4": "7 هجري",
    "right_answer": 4
  },
  {
    "question": "كم عدد الأنبياء الذين ذكروا في سورة الأنبياء؟",
    "answer_1": "18 نبي",
    "answer_2": "19 نبي",
    "answer_3": "16 نبي",
    "answer_4": "25 نبي",
    "right_answer": 3
  },
  {
    "question": "ما هو الاسم الذي يطلق على الزيادة في الدين نظير الأجل أو الزيادة فيه؟",
    "answer_1": "ربا النسيئة",
    "answer_2": "ربا الفضل",
    "answer_3": "مضاربة مشروعة",
    "answer_4": "ربا المال",
    "right_answer": 1
  },
  {
    "question": "ما هي السورة التي لا تبدأ بالبسملة؟",
    "answer_1": "النحل",
    "answer_2": "النمل",
    "answer_3": "الإسراء",
    "answer_4": "التوبة",
    "right_answer": 4
  },
  {
    "question": "من أول من ألف في أحكام القرآن؟",
    "answer_1": "الامام الشافعي",
    "answer_2": "الامام حمد بن حنبل",
    "answer_3": "الامام المالكي",
    "answer_4": "الامام أبي حنيفة",
    "right_answer": 1
  },
  {
    "question": "في أي سورة ذكرت قصة قابيل وهابيل؟",
    "answer_1": "سورة الأعراف",
    "answer_2": "سورة القصص",
    "answer_3": "سورة الأنعام",
    "answer_4": "سورة المائدة",
    "right_answer": 4
  },
  {
    "question": "ما اسم الزوجة الثالثة بالترتيب التي تزوجها النبي صلى الله عليه وسلم؟",
    "answer_1": "حفصة بنت عمر",
    "answer_2": "عائشة بنت أبي بكر الصديق",
    "answer_3": "أم سلمة",
    "answer_4": "سودة بنت زمعة",
    "right_answer": 2
  },
  {
    "question": "من من الخلفاء الراشدين كان الأكبر سنا عندما لقي ربه؟",
    "answer_1": "عثمان بن عفان",
    "answer_2": "أبو بكر الصديق",
    "answer_3": "عمر بن الخطاب",
    "answer_4": "علي بن أبي طالب",
    "right_answer": 1
  },
  {
    "question": "من أول من لقب بأمير المؤمنين؟",
    "answer_1": "عثمان بن عفان",
    "answer_2": "أبو بكر الصديق",
    "answer_3": "عمر بن الخطاب",
    "answer_4": "علي بن أبي طالب",
    "right_answer": 3
  },
  {
    "question": "يجب اخراج الزكاة من الذهب اذا كان يبلغ النصاب الشرعي وهو؟",
    "answer_1": "88 غراما",
    "answer_2": "78 غراما",
    "answer_3": "85 غراما",
    "answer_4": "58 غراما",
    "right_answer": 3
  },
  {
    "question": "ماذا لقب ابراهيم عليه السلام؟",
    "answer_1": "الصديق",
    "answer_2": "شيخ المرسلين",
    "answer_3": "اسرائيل",
    "answer_4": "الخليل",
    "right_answer": 4
  },
  {
      "question": "كي يسلم اي شخص ماذا يجب عليه فعله ؟؟",
      "answer_1": "الزكاة",
      "answer_2": "الصلاة",
      "answer_3": "نطق الشهادتين ثم اتباع ما سبق",
      "answer_4": "الحج والصيام",
      "right_answer": 3
    },
    {
      "question": "حكم الصلاة قاعداً",
      "answer_1": "اذا كان مريضاً يجوز له",
      "answer_2": "لا يجوز",
      "answer_3": "يجوز",
      "answer_4": "ا",
      "right_answer": 1
    },
    {
      "question": "كم عدد جميع ركعات الصلاة في اليوم ؟؟",
      "answer_1": "12",
      "answer_2": "17",
      "answer_3": "20",
      "answer_4": "15",
      "right_answer": 2
    },
    {
      "question": "ما هو الدعاء الذي يردده المصلين بين السجدتين ؟؟",
      "answer_1": "اللهم اغفر لي ذنبي",
      "answer_2": "سبحان ربي الأعلى",
      "answer_3": "لا حول ولا قوة الا بلله",
      "answer_4": "سبحان رب العرش العظيم",
      "right_answer": 1
    },
    {
      "question": "اسم الملك الذي يقف خازناً على جهنم؟؟؟",
      "answer_1": "النار",
      "answer_2": "مالك",
      "answer_3": "ا",
      "answer_4": "ا",
      "right_answer": 2
    },
    {
      "question": "من هو أول نبي قام بإرتداء السروال ؟؟",
      "answer_1": "سيدنا أبراهيم صلى الله عليه السلام",
      "answer_2": "سيدنا محمد صلي الله عليه وسلم",
      "answer_3": "سيدنا عيسى عليه السلام",
      "answer_4": "سيدنا موسى عليه السلام",
      "right_answer": 1
    },
    {
      "question": "أي من الأنبياء كان يتمنى موته ؟",
      "answer_1": "سيدنا نوح عليه السلام",
      "answer_2": "سيدنا آدم عليه السلام",
      "answer_3": "سيدنا يوسف عليه السلام",
      "answer_4": "سيدنا موسى عليه السلام",
      "right_answer": 3
    },
    {
      "question": "اذكر عدد سجدات التلاوة في القرآن الكريم ؟؟",
      "answer_1": "10",
      "answer_2": "20",
      "answer_3": "15",
      "answer_4": "19",
      "right_answer": 3
    },
    {
      "question": "من اول نبي صام ؟؟",
      "answer_1": "سيدنا ادم",
      "answer_2": "سيدنا عيسى",
      "answer_3": "سيدنا محمد",
      "answer_4": "ا",
      "right_answer": 1
    },
    {
      "question": "اذكر المهنتين التي عمل فيهما الرسول محمد صلى الله عليه وسلم",
      "answer_1": "الرعي والخياطة",
      "answer_2": "التجارة والسباكة",
      "answer_3": "الرعي والتجارة",
      "answer_4": "لاشئ مما سبق",
      "right_answer": 3
    },
    {
      "question": "من الشخص الذي انزلت عليه سورة الهمزة ؟؟",
      "answer_1": "أبو جهل",
      "answer_2": "أمية بن خلف",
      "answer_3": "سعد بن ابي وقاس",
      "answer_4": "ابي سفيان",
      "right_answer": 2
    },
    {
      "question": "ما هي اسم ناقة سيدنا محمد صلى الله عليه وسلم ؟؟",
      "answer_1": "القصاء",
      "answer_2": "المقصية",
      "answer_3": "القصواء",
      "answer_4": "ا",
      "right_answer": 3
    },
    {
      "question": "كم عيد للمسلمين؟",
      "answer_1": "1",
      "answer_2": "3",
      "answer_3": "2",
      "answer_4": "5",
      "right_answer": 3
    },
    {
      "question": "اسم أم نبينا محمد (صلى الله عليه و سلم)",
      "answer_1": "أمنه",
      "answer_2": "سارة",
      "answer_3": "ام كلثوم",
      "answer_4": "ا",
      "right_answer": 1
    },
    {
      "question": "كم مرة ذكرت اسم الجنة فى القرآن الكريم؟",
      "answer_1": "45",
      "answer_2": "66",
      "answer_3": "12",
      "answer_4": "43",
      "right_answer": 2
    },
    {
      "question": "صح أم خطأ : هل صلاة الجمعة واجبه ؟",
      "answer_1": "نعم, لانها تكون في وقت صلاة الظهر, و تصلي أربع ركعات اذا فاتك وقتها.",
      "answer_2": "لا , ليست واجبه لانه تتكون من ركعتين.",
      "answer_3": "ا",
      "answer_4": "ا",
      "right_answer": 1
    },
    {
      "question": "كم سورة في القرآن؟",
      "answer_1": "30",
      "answer_2": "60",
      "answer_3": "112",
      "answer_4": "114",
      "right_answer": 4
    },
    {
      "question": "متي توفي الرسول -صلي الله عليه وسلم-وكم كان عمره؟؟؟",
      "answer_1": "توفي يوم الثلاثاء وعمره 45",
      "answer_2": "توفي يوم الثلاثاء وعمره 62",
      "answer_3": "توفي يوم الاثنين وعمره 63",
      "answer_4": "توفي يوم الجمعه وعمره 64",
      "right_answer": 3
    },
    {
      "question": "إلى أي قبيلة ينتمي الرسول صلى الله عليه وسلم ؟",
      "answer_1": "قبيلة قريش العدنانيه",
      "answer_2": "قبيله همدان",
      "answer_3": "قبيله جرهم اليمنيه",
      "answer_4": "قبيله كنده",
      "right_answer": 1
    },
    {
      "question": "من أول من أسلم من الصبيان ؟؟",
      "answer_1": "ابو بكر الصديق",
      "answer_2": "علي بن ابي طالب",
      "answer_3": "عثمان بن عفان",
      "answer_4": "عمر بن الخطاب",
      "right_answer": 2
    },
    {
      "question": "اول من اسلم من النساء ؟",
      "answer_1": "خديجه",
      "answer_2": "فاطمه",
      "answer_3": "مريم",
      "answer_4": "عائشه",
      "right_answer": 1
    },
    {
      "question": "ما معنى الميسر ؟",
      "answer_1": "الأنصاب",
      "answer_2": "الأزلام",
      "answer_3": "الخمر",
      "answer_4": "القمار",
      "right_answer": 4
    },
    {
      "question": "من هي مرضعة الرسول (ص) حتّى شبّ ؟",
      "answer_1": "حليمه",
      "answer_2": "امنة",
      "answer_3": "فاطمه",
      "answer_4": "هاجر",
      "right_answer": 1
    },
    {
      "question": "كم عدد السجدات الموجوده في القران ؟",
      "answer_1": "13",
      "answer_2": "15",
      "answer_3": "16",
      "answer_4": "20",
      "right_answer": 2
    },
    {
      "question": "ما هي السورة التي كانت سببا في إسلام عمر بن الخطاب رضي الله عنه ؟",
      "answer_1": "ال عمران",
      "answer_2": "الاحقاف",
      "answer_3": "طة",
      "answer_4": "مريم",
      "right_answer": 3
    },
    {
      "question": "ما اسم الكتب التي أنزلها الله على داود ؟",
      "answer_1": "الانجيل",
      "answer_2": "الزبور",
      "answer_3": "الصحف",
      "answer_4": "القران",
      "right_answer": 2
    },
    {
      "question": "ماهي السورة التي يطلق عليها عروس القرآن ؟",
      "answer_1": "ال عمران",
      "answer_2": "البقره",
      "answer_3": "الرحمن",
      "answer_4": "الفاتحه",
      "right_answer": 3
    },
    {
      "question": "من أول من نقض العهد مع الرسول صلى الله عليه وسلم من القبائل اليهودية ؟",
      "answer_1": "يهود بني الاشبح",
      "answer_2": "يهود بني قوفه",
      "answer_3": "يهود بني قينقاع",
      "answer_4": "يهود الاوس",
      "right_answer": 3
    },
    {
      "question": "ما أول صلاة فرضت على الرسول صلى الله عليه وسلم ؟",
      "answer_1": "العصر",
      "answer_2": "الضهر",
      "answer_3": "المغرب",
      "answer_4": "الفجر",
      "right_answer": 2
    },
    {
      "question": "من أول من ألف في أحكام القرآن ؟",
      "answer_1": "الشافعي",
      "answer_2": "الحبشي",
      "answer_3": "الاموي",
      "answer_4": "صحيح مسلم",
      "right_answer": 1
    },
    {
      "question": "من أول من فتق لسانه بالعربية ؟",
      "answer_1": "اسحاق",
      "answer_2": "نوح",
      "answer_3": "اسماعيل",
      "answer_4": "يعقوب",
      "right_answer": 3
    },
    {
      "question": "ماهي السورة التي لا تحوي حرف الميم ؟",
      "answer_1": "الكوثر",
      "answer_2": "الاخلاص",
      "answer_3": "المسد",
      "answer_4": "الفلق",
      "right_answer": 1
    },
    {
      "question": "في أي الغزوات أسرت الشيماء أخت الرسول صلى الله عليه وسلم من الرضاعة ؟",
      "answer_1": "احد",
      "answer_2": "الاحزاب",
      "answer_3": "حنين",
      "answer_4": "الكوفه",
      "right_answer": 3
    },
    {
      "question": "من هو الصحابي الذي اهتز عرش الرحمن لموته ؟",
      "answer_1": "حمزه",
      "answer_2": "سعد بن معاذ",
      "answer_3": "ابو ذر الغفاري",
      "answer_4": "كعب بن مالك",
      "right_answer": 2
    },
    {
      "question": "ما هي السورة التي وردت فيها سجدتان في القرآن الكريم ؟",
      "answer_1": "البقره",
      "answer_2": "الرحمن",
      "answer_3": "الحج",
      "answer_4": "ال عمران",
      "right_answer": 3
    }
];

let IslamicQuiz = {
  id: '',
  player: '',
  question: '',
  correctAnswer: 0,
};

const quizDuration = 30; 


cmd({
  pattern: 'iqg', //islamic question game
  filename: __filename
}, async (message, match, group) => {
  const randomQuestion = quizData[Math.floor(Math.random() * quizData.length)];

  IslamicQuiz[match.sender] = {
    id: match.chat,
    player: match.sender,
    question: randomQuestion.question,
    correctAnswer: randomQuestion.right_answer,
  };

  await message.sendMessage(match.chat, {
    text: `*🌙 Islamic questions 🌙*\n\n${randomQuestion.question}\n\nAnswer options:\n1. ${randomQuestion.answer_1}\n2. ${randomQuestion.answer_2}\n3. ${randomQuestion.answer_3}\n4. ${randomQuestion.answer_4}\n`,
    mentions: [match.sender]
  });

  IslamicQuiz[match.sender].timer = setTimeout(() => {
    quizTimeout(message, match);
  }, quizDuration * 1000);
});

cmd({
  on: 'text'
}, async (message, match, group) => {
  const gameData = IslamicQuiz[match.sender];

  if (!gameData) return;

  if (gameData.id === match.chat && gameData.player === match.sender) {
    if (!isNaN(match.text)) {
      clearTimeout(gameData.timer); 

      const userAnswer = parseInt(match.text);

      if (userAnswer === gameData.correctAnswer) {
        const winMessage = 'Your answer is correct ✅ .';

        await message.sendMessage(match.chat, {
          text: winMessage,
          mentions: [gameData.player]
        });

        delete IslamicQuiz[match.sender];
      } else {
        const loseMessage = 'False, the correct answer is ' + gameData.correctAnswer;

        await message.sendMessage(match.chat, {
          text: loseMessage,
          mentions: [gameData.player]
        });

        delete IslamicQuiz[match.sender];
      }
    }
  }
});
function quizTimeout(message, match) {
  const gameData = IslamicQuiz[match.sender];
  if (gameData) {
    message.sendMessage(match.chat, {
      text: '🌙 Time is up ⌛* You did not answer on time. The correct answer is ' + gameData.correctAnswer,
      mentions: [gameData.player]
    });

    delete IslamicQuiz[match.sender];
  }
}
//----------------------------------------------------------------
